tests-artillery-auth/carga-alta.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 100
    - duration: 20
      arrivalRate: 300
    - duration: 20
      arrivalRate: 600

scenarios:
  - name: Test login carga alta
    flow:
      - post:
          url: "/auth/login"
          json:
            nombre_usuario: "Instructor"
            password: "admin123"